{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "elu", "trainable": true, "batch_input_shape": [null, 3, 16, 32], "nb_row": 3, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "input_dtype": "float32", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "subsample": [1, 1], "nb_filter": 32, "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "trainable": true, "nb_row": 3, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "subsample": [1, 1], "nb_filter": 64, "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "trainable": true, "nb_row": 1, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "subsample": [1, 1], "nb_filter": 128, "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "elu", "trainable": true, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "output_dim": 100, "name": "dense_1", "W_constraint": null, "input_dim": 4096, "init": "glorot_uniform", "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "elu", "trainable": true, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "output_dim": 50, "name": "dense_2", "W_constraint": null, "input_dim": 100, "init": "glorot_uniform", "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "elu", "trainable": true, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "output_dim": 10, "name": "dense_3", "W_constraint": null, "input_dim": 50, "init": "glorot_uniform", "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "output_dim": 1, "name": "dense_4", "W_constraint": null, "input_dim": 10, "init": "glorot_uniform", "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}]}